---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.FailedDowngradeCrossToElbow
source: html/fb91d76a-10a0-bc20-1292-5d6919205b28.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.FailedDowngradeCrossToElbow Property

Failed to downgrade tee type to elbow type.

## Syntax (C#)
```csharp
public static FailureDefinitionId FailedDowngradeCrossToElbow { get; }
```